<?php
/**
 * 快速排序
 * Array ( [0] => 8 [1] => 9 [2] => 3 [3] => 4 [4] => 0 [5] => 6 [6] => 1 ) 
 * =======上为初始值=================下为排序后==============================
 * Array ( [0] => 0 [1] => 1 [2] => 3 [3] => 4 [4] => 6 [5] => 8 [6] => 9 ) 
 */

function quick(&$value, $left, $right)
{
    // 左右界重合 跳出
    if ($left >= $right) {
      return ;
    }
    $base = $left;
    do {
      for ($i = $right; $i > $base; --$i) {
        // TODO...
      }
    } while ($i > $j); // 直到左右索引重合为止

}